<a href="https://colab.research.google.com/github/christinezuzart/Learning/blob/main/Pandas_Refresher.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [347]:
import pandas as pd

In [348]:
df = pd.read_csv("/content/sample_data/california_housing_train.csv")

In [349]:
df

       longitude  latitude  ...  median_income  median_house_value
0        -114.31     34.19  ...         1.4936             66900.0
1        -114.47     34.40  ...         1.8200             80100.0
2        -114.56     33.69  ...         1.6509             85700.0
3        -114.57     33.64  ...         3.1917             73400.0
4        -114.57     33.57  ...         1.9250             65500.0
...          ...       ...  ...            ...                 ...
16995    -124.26     40.58  ...         2.3571            111400.0
16996    -124.27     40.69  ...         2.5179             79000.0
16997    -124.30     41.84  ...         3.0313            103600.0
16998    -124.30     41.80  ...         1.9797             85800.0
16999    -124.35     40.54  ...         3.0147             94600.0

[17000 rows x 9 columns]

In [350]:
df.shape

(17000, 9)

In [351]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 17000 entries, 0 to 16999
Data columns (total 9 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   longitude           17000 non-null  float64
 1   latitude            17000 non-null  float64
 2   housing_median_age  17000 non-null  float64
 3   total_rooms         17000 non-null  float64
 4   total_bedrooms      17000 non-null  float64
 5   population          17000 non-null  float64
 6   households          17000 non-null  float64
 7   median_income       17000 non-null  float64
 8   median_house_value  17000 non-null  float64
dtypes: float64(9)
memory usage: 1.2 MB

In [352]:
df.head()

   longitude  latitude  ...  median_income  median_house_value
0    -114.31     34.19  ...         1.4936             66900.0
1    -114.47     34.40  ...         1.8200             80100.0
2    -114.56     33.69  ...         1.6509             85700.0
3    -114.57     33.64  ...         3.1917             73400.0
4    -114.57     33.57  ...         1.9250             65500.0

[5 rows x 9 columns]

In [353]:
df.head(10)

   longitude  latitude  ...  median_income  median_house_value
0    -114.31     34.19  ...         1.4936             66900.0
1    -114.47     34.40  ...         1.8200             80100.0
2    -114.56     33.69  ...         1.6509             85700.0
3    -114.57     33.64  ...         3.1917             73400.0
4    -114.57     33.57  ...         1.9250             65500.0
5    -114.58     33.63  ...         3.3438             74000.0
6    -114.58     33.61  ...         2.6768             82400.0
7    -114.59     34.83  ...         1.7083             48500.0
8    -114.59     33.61  ...         2.1782             58400.0
9    -114.60     34.83  ...         2.1908             48100.0

[10 rows x 9 columns]

In [354]:
df.tail(10)

       longitude  latitude  ...  median_income  median_house_value
16990    -124.22     41.73  ...         1.7038             78300.0
16991    -124.23     41.75  ...         2.4805             73200.0
16992    -124.23     40.81  ...         3.3462             50800.0
16993    -124.23     40.54  ...         3.0806            106700.0
16994    -124.25     40.28  ...         1.9417             76100.0
16995    -124.26     40.58  ...         2.3571            111400.0
16996    -124.27     40.69  ...         2.5179             79000.0
16997    -124.30     41.84  ...         3.0313            103600.0
16998    -124.30     41.80  ...         1.9797             85800.0
16999    -124.35     40.54  ...         3.0147             94600.0

[10 rows x 9 columns]

# Creating dataframes from dictionaries

In [355]:
people = {'first':['Mary', 'John', "Tiya"],
          'last':['Turner', 'Doe', 'Roza']}

In [356]:
df = pd.DataFrame(people)

In [357]:
df

  first    last
0  Mary  Turner
1  John     Doe
2  Tiya    Roza

In [358]:
df['last']

0    Turner
1       Doe
2      Roza
Name: last, dtype: object

In [359]:
type(df['last'])

pandas.core.series.Series

# Using [ ] is preferable over '.' it may happen to access the method

In [360]:
df.last

<bound method NDFrame.last of   first    last
0  Mary  Turner
1  John     Doe
2  Tiya    Roza>

In [361]:
df[['last', 'first']]

     last first
0  Turner  Mary
1     Doe  John
2    Roza  Tiya

In [362]:
df.columns

Index(['first', 'last'], dtype='object')

# Accessing rows by integer location

### Here indexes are the column names

In [363]:
df.iloc[0]

first      Mary
last     Turner
Name: 0, dtype: object

# Accesing multiple rows

In [364]:
df.iloc[[0,2]]

  first    last
0  Mary  Turner
2  Tiya    Roza

In [365]:
df.iloc[[0,2], 1]

0    Turner
2      Roza
Name: last, dtype: object

#Accessing rows by labels

In [366]:
df.loc[0]

first      Mary
last     Turner
Name: 0, dtype: object

In [367]:
df.loc[[0,1]]

  first    last
0  Mary  Turner
1  John     Doe

In [368]:
df.loc[[0,1],'last']

0    Turner
1       Doe
Name: last, dtype: object

In [369]:
df.loc[[0,1],['last', 'first']]

     last first
0  Turner  Mary
1     Doe  John

In [370]:
sample = {'Hobby':['Y', 'N', 'Y', 'N', 'Y', 'N', 'Y', 'N', 'Y', 'N', 'Y', 'N','N', 'N']}

In [371]:
df_sample = pd.DataFrame(sample)

In [372]:
df_sample['Hobby']

0     Y
1     N
2     Y
3     N
4     Y
5     N
6     Y
7     N
8     Y
9     N
10    Y
11    N
12    N
13    N
Name: Hobby, dtype: object

In [373]:
df_sample['Hobby'].value_counts()

N    8
Y    6
Name: Hobby, dtype: int64

In [374]:
df = pd.read_csv("/content/sample_data/california_housing_train.csv")

In [375]:
df

       longitude  latitude  ...  median_income  median_house_value
0        -114.31     34.19  ...         1.4936             66900.0
1        -114.47     34.40  ...         1.8200             80100.0
2        -114.56     33.69  ...         1.6509             85700.0
3        -114.57     33.64  ...         3.1917             73400.0
4        -114.57     33.57  ...         1.9250             65500.0
...          ...       ...  ...            ...                 ...
16995    -124.26     40.58  ...         2.3571            111400.0
16996    -124.27     40.69  ...         2.5179             79000.0
16997    -124.30     41.84  ...         3.0313            103600.0
16998    -124.30     41.80  ...         1.9797             85800.0
16999    -124.35     40.54  ...         3.0147             94600.0

[17000 rows x 9 columns]

In [376]:
df.loc[0,'total_rooms']

5612.0

In [377]:
df.loc[[0,1,2],'total_rooms']

0    5612.0
1    7650.0
2     720.0
Name: total_rooms, dtype: float64

#Slicing

In [378]:
df.loc[0:2,'total_rooms']

0    5612.0
1    7650.0
2     720.0
Name: total_rooms, dtype: float64

In [379]:
df.loc[0:2,'total_rooms': 'median_income']

   total_rooms  total_bedrooms  population  households  median_income
0       5612.0          1283.0      1015.0       472.0         1.4936
1       7650.0          1901.0      1129.0       463.0         1.8200
2        720.0           174.0       333.0       117.0         1.6509

In [380]:
df.set_index('total_rooms')

             longitude  latitude  ...  median_income  median_house_value
total_rooms                       ...
5612.0         -114.31     34.19  ...         1.4936             66900.0
7650.0         -114.47     34.40  ...         1.8200             80100.0
720.0          -114.56     33.69  ...         1.6509             85700.0
1501.0         -114.57     33.64  ...         3.1917             73400.0
1454.0         -114.57     33.57  ...         1.9250             65500.0
...                ...       ...  ...            ...                 ...
2217.0         -124.26     40.58  ...         2.3571            111400.0
2349.0         -124.27     40.69  ...         2.5179             79000.0
2677.0         -124.30     41.84  ...         3.0313            103600.0
2672.0         -124.30     41.80  ...         1.9797             85800.0
1820.0         -124.35     40.54  ...         3.0147             94600.0

[17000 rows x 8 columns]

In [381]:
df

       longitude  latitude  ...  median_income  median_house_value
0        -114.31     34.19  ...         1.4936             66900.0
1        -114.47     34.40  ...         1.8200             80100.0
2        -114.56     33.69  ...         1.6509             85700.0
3        -114.57     33.64  ...         3.1917             73400.0
4        -114.57     33.57  ...         1.9250             65500.0
...          ...       ...  ...            ...                 ...
16995    -124.26     40.58  ...         2.3571            111400.0
16996    -124.27     40.69  ...         2.5179             79000.0
16997    -124.30     41.84  ...         3.0313            103600.0
16998    -124.30     41.80  ...         1.9797             85800.0
16999    -124.35     40.54  ...         3.0147             94600.0

[17000 rows x 9 columns]

In [382]:
df.set_index('total_rooms', inplace = True)

In [383]:
df

             longitude  latitude  ...  median_income  median_house_value
total_rooms                       ...
5612.0         -114.31     34.19  ...         1.4936             66900.0
7650.0         -114.47     34.40  ...         1.8200             80100.0
720.0          -114.56     33.69  ...         1.6509             85700.0
1501.0         -114.57     33.64  ...         3.1917             73400.0
1454.0         -114.57     33.57  ...         1.9250             65500.0
...                ...       ...  ...            ...                 ...
2217.0         -124.26     40.58  ...         2.3571            111400.0
2349.0         -124.27     40.69  ...         2.5179             79000.0
2677.0         -124.30     41.84  ...         3.0313            103600.0
2672.0         -124.30     41.80  ...         1.9797             85800.0
1820.0         -124.35     40.54  ...         3.0147             94600.0

[17000 rows x 8 columns]

In [384]:
df.index

Float64Index([5612.0, 7650.0,  720.0, 1501.0, 1454.0, 1387.0, 2907.0,  812.0,
              4789.0, 1497.0,
              ...
              3003.0, 3159.0, 1112.0, 2694.0, 1430.0, 2217.0, 2349.0, 2677.0,
              2672.0, 1820.0],
             dtype='float64', name='total_rooms', length=17000)

In [385]:
df.loc[1820.0]

             longitude  latitude  ...  median_income  median_house_value
total_rooms                       ...
1820.0         -116.68     33.16  ...         2.1797            156300.0
1820.0         -117.18     34.05  ...         2.6129            137000.0
1820.0         -117.29     34.15  ...         3.2976            102600.0
1820.0         -122.13     37.87  ...        10.3713            426100.0
1820.0         -124.35     40.54  ...         3.0147             94600.0

[5 rows x 8 columns]

In [386]:
df.loc[1820.0, 'longitude']

total_rooms
1820.0   -116.68
1820.0   -117.18
1820.0   -117.29
1820.0   -122.13
1820.0   -124.35
Name: longitude, dtype: float64

In [387]:
df.reset_index(inplace=True)

In [388]:
df

       total_rooms  longitude  ...  median_income  median_house_value
0           5612.0    -114.31  ...         1.4936             66900.0
1           7650.0    -114.47  ...         1.8200             80100.0
2            720.0    -114.56  ...         1.6509             85700.0
3           1501.0    -114.57  ...         3.1917             73400.0
4           1454.0    -114.57  ...         1.9250             65500.0
...            ...        ...  ...            ...                 ...
16995       2217.0    -124.26  ...         2.3571            111400.0
16996       2349.0    -124.27  ...         2.5179             79000.0
16997       2677.0    -124.30  ...         3.0313            103600.0
16998       2672.0    -124.30  ...         1.9797             85800.0
16999       1820.0    -124.35  ...         3.0147             94600.0

[17000 rows x 9 columns]

In [389]:
df = pd.read_csv("/content/sample_data/california_housing_train.csv", index_col = 'total_rooms')

In [390]:
df.head()

             longitude  latitude  ...  median_income  median_house_value
total_rooms                       ...
5612.0         -114.31     34.19  ...         1.4936             66900.0
7650.0         -114.47     34.40  ...         1.8200             80100.0
720.0          -114.56     33.69  ...         1.6509             85700.0
1501.0         -114.57     33.64  ...         3.1917             73400.0
1454.0         -114.57     33.57  ...         1.9250             65500.0

[5 rows x 8 columns]

In [391]:
df.sort_index()

             longitude  latitude  ...  median_income  median_house_value
total_rooms                       ...
2.0            -117.79     35.21  ...         2.3750            137500.0
8.0            -122.50     37.79  ...        15.0001            500001.0
11.0           -118.44     34.28  ...         2.8750            162500.0
12.0           -122.29     37.81  ...         0.4999             67500.0
15.0           -122.37     37.60  ...         5.0480            350000.0
...                ...       ...  ...            ...                 ...
30401.0        -117.12     33.52  ...         4.5841            212300.0
30405.0        -118.78     34.16  ...         8.0137            399200.0
32054.0        -117.78     34.03  ...         6.0191            253900.0
32627.0        -121.79     36.64  ...         2.3087            118800.0
37937.0        -117.74     33.89  ...         7.4947            366300.0

[17000 rows x 8 columns]

In [392]:
df.index.value_counts()

1582.0     16
1527.0     15
1717.0     14
1471.0     14
1703.0     14
           ..
157.0       1
2760.0      1
458.0       1
10239.0     1
4068.0      1
Name: total_rooms, Length: 5533, dtype: int64

In [393]:
df.sort_index(ascending=False)

             longitude  latitude  ...  median_income  median_house_value
total_rooms                       ...
37937.0        -117.74     33.89  ...         7.4947            366300.0
32627.0        -121.79     36.64  ...         2.3087            118800.0
32054.0        -117.78     34.03  ...         6.0191            253900.0
30405.0        -118.78     34.16  ...         8.0137            399200.0
30401.0        -117.12     33.52  ...         4.5841            212300.0
...                ...       ...  ...            ...                 ...
15.0           -118.04     33.90  ...         0.4999            162500.0
12.0           -122.29     37.81  ...         0.4999             67500.0
11.0           -118.44     34.28  ...         2.8750            162500.0
8.0            -122.50     37.79  ...        15.0001            500001.0
2.0            -117.79     35.21  ...         2.3750            137500.0

[17000 rows x 8 columns]

# Filtering - Using Conditionals to Filter Rows and Columns

In [394]:
df['total_bedrooms'] == 5

total_rooms
5612.0    False
7650.0    False
720.0     False
1501.0    False
1454.0    False
          ...
2217.0    False
2349.0    False
2677.0    False
2672.0    False
1820.0    False
Name: total_bedrooms, Length: 17000, dtype: bool

In [395]:
filt = (df['total_bedrooms'] == 5)

In [396]:
df_filt = df[filt]

In [397]:
df_filt

             longitude  latitude  ...  median_income  median_house_value
total_rooms                       ...
25.0           -117.19     32.75  ...         0.5360            162500.0
20.0           -117.86     33.67  ...         3.8750            450000.0
15.0           -118.04     33.90  ...         0.4999            162500.0
50.0           -121.96     37.13  ...        15.0001            400000.0

[4 rows x 8 columns]

In [398]:
df.loc[filt]

             longitude  latitude  ...  median_income  median_house_value
total_rooms                       ...
25.0           -117.19     32.75  ...         0.5360            162500.0
20.0           -117.86     33.67  ...         3.8750            450000.0
15.0           -118.04     33.90  ...         0.4999            162500.0
50.0           -121.96     37.13  ...        15.0001            400000.0

[4 rows x 8 columns]

In [399]:
df.loc[filt,'population']

total_rooms
25.0    13.0
20.0    15.0
15.0    15.0
50.0    17.0
Name: population, dtype: float64

In [400]:
filt = (df['total_bedrooms'] == 5) & (df['population'] == 15)

In [401]:
df[filt]

             longitude  latitude  ...  median_income  median_house_value
total_rooms                       ...
20.0           -117.86     33.67  ...         3.8750            450000.0
15.0           -118.04     33.90  ...         0.4999            162500.0

[2 rows x 8 columns]

In [402]:
filt = (df['total_bedrooms'] == 5) | (df['population'] == 15)

In [403]:
df[filt]

             longitude  latitude  ...  median_income  median_house_value
total_rooms                       ...
25.0           -117.19     32.75  ...         0.5360            162500.0
20.0           -117.86     33.67  ...         3.8750            450000.0
15.0           -118.04     33.90  ...         0.4999            162500.0
50.0           -121.96     37.13  ...        15.0001            400000.0

[4 rows x 8 columns]

In [404]:
df[~filt]

             longitude  latitude  ...  median_income  median_house_value
total_rooms                       ...
5612.0         -114.31     34.19  ...         1.4936             66900.0
7650.0         -114.47     34.40  ...         1.8200             80100.0
720.0          -114.56     33.69  ...         1.6509             85700.0
1501.0         -114.57     33.64  ...         3.1917             73400.0
1454.0         -114.57     33.57  ...         1.9250             65500.0
...                ...       ...  ...            ...                 ...
2217.0         -124.26     40.58  ...         2.3571            111400.0
2349.0         -124.27     40.69  ...         2.5179             79000.0
2677.0         -124.30     41.84  ...         3.0313            103600.0
2672.0         -124.30     41.80  ...         1.9797             85800.0
1820.0         -124.35     40.54  ...         3.0147             94600.0

[16996 rows x 8 columns]

In [405]:
many_beds = (df['total_bedrooms'] > 1000)

In [406]:
df.loc[many_beds]

             longitude  latitude  ...  median_income  median_house_value
total_rooms                       ...
5612.0         -114.31     34.19  ...         1.4936             66900.0
7650.0         -114.47     34.40  ...         1.8200             80100.0
4789.0         -114.59     33.61  ...         2.1782             58400.0
3868.0         -115.85     34.20  ...         1.3571             41000.0
10377.0        -116.06     34.15  ...         2.2466             66800.0
...                ...       ...  ...            ...                 ...
5569.0         -123.22     39.28  ...         3.1455            142900.0
5372.0         -123.34     39.10  ...         3.0652            131100.0
5409.0         -123.49     38.70  ...         3.3125            295400.0
5202.0         -123.59     38.80  ...         3.1201            176100.0
5694.0         -124.19     40.73  ...         3.5363             90100.0

[1576 rows x 8 columns]

In [407]:
df.loc[many_beds,['population','households']]

             population  households
total_rooms
5612.0           1015.0       472.0
7650.0           1129.0       463.0
4789.0           3134.0      1056.0
3868.0            890.0       423.0
10377.0          4507.0      1807.0
...                 ...         ...
5569.0           3148.0      1088.0
5372.0           3002.0       992.0
5409.0            594.0       327.0
5202.0           1742.0       803.0
5694.0           2907.0       972.0

[1576 rows x 2 columns]

In [408]:
age = ['10','20','30']
filt = df['housing_median_age'].isin(age)

In [409]:
df.loc[filt,'housing_median_age']

total_rooms
1454.0    20.0
1491.0    20.0
350.0     20.0
1602.0    30.0
1402.0    20.0
          ...
1075.0    20.0
2673.0    20.0
1895.0    30.0
2975.0    30.0
3810.0    20.0
Name: housing_median_age, Length: 993, dtype: float64

# Updating Rows and Columns - Modifying Data Within DataFrames

In [410]:
people = {'first':['Mary', 'John', 'Tiya'],
          'last':['Turner', 'Doe', 'Roza'],
          'email':['Mary.T@gmail.com', 'John.D@gmail.com', 'Tiya.R@gmail.com']}

In [411]:
df_ppl = pd.DataFrame(people)

In [412]:
df_ppl

  first    last             email
0  Mary  Turner  Mary.T@gmail.com
1  John     Doe  John.D@gmail.com
2  Tiya    Roza  Tiya.R@gmail.com

In [413]:
df_ppl.columns = ['first_name', 'last_name', 'email']

In [414]:
df_ppl

  first_name last_name             email
0       Mary    Turner  Mary.T@gmail.com
1       John       Doe  John.D@gmail.com
2       Tiya      Roza  Tiya.R@gmail.com

In [415]:
df_ppl.columns = [x.upper() for x in df_ppl.columns]

In [416]:
df_ppl

  FIRST_NAME LAST_NAME             EMAIL
0       Mary    Turner  Mary.T@gmail.com
1       John       Doe  John.D@gmail.com
2       Tiya      Roza  Tiya.R@gmail.com

In [417]:
df_ppl.columns = df_ppl.columns.str.replace('_', ' ')

In [418]:
df_ppl.columns

Index(['FIRST NAME', 'LAST NAME', 'EMAIL'], dtype='object')

In [419]:
df_ppl.columns = df_ppl.columns.str.replace('  ', '_')

In [420]:
df_ppl

  FIRST NAME LAST NAME             EMAIL
0       Mary    Turner  Mary.T@gmail.com
1       John       Doe  John.D@gmail.com
2       Tiya      Roza  Tiya.R@gmail.com

In [421]:
df_ppl.columns = [x.lower() for x in df_ppl.columns]

In [422]:
df_ppl

  first name last name             email
0       Mary    Turner  Mary.T@gmail.com
1       John       Doe  John.D@gmail.com
2       Tiya      Roza  Tiya.R@gmail.com

In [423]:
df_ppl.rename(columns= {'first name':'first', 'last name':'last'})

  first    last             email
0  Mary  Turner  Mary.T@gmail.com
1  John     Doe  John.D@gmail.com
2  Tiya    Roza  Tiya.R@gmail.com

In [424]:
df_ppl.rename(columns= {'first name':'first', 'last name':'last'}, inplace=True)

In [425]:
df_ppl

  first    last             email
0  Mary  Turner  Mary.T@gmail.com
1  John     Doe  John.D@gmail.com
2  Tiya    Roza  Tiya.R@gmail.com

#Updating data in a row

In [426]:
df_ppl.loc[2] = ['Tiya', 'Smith', 'Tiya.S@gmail.com']

In [427]:
df_ppl

  first    last             email
0  Mary  Turner  Mary.T@gmail.com
1  John     Doe  John.D@gmail.com
2  Tiya   Smith  Tiya.S@gmail.com

# Changing onl specific column values in a row

In [428]:
df_ppl.loc[2,['last','email']] = ['Roza', 'Tiya.R@gmail.com']

In [429]:
df_ppl

  first    last             email
0  Mary  Turner  Mary.T@gmail.com
1  John     Doe  John.D@gmail.com
2  Tiya    Roza  Tiya.R@gmail.com

In [430]:
df_ppl.loc[2,'last'] = 'Smith'

In [431]:
df_ppl

  first    last             email
0  Mary  Turner  Mary.T@gmail.com
1  John     Doe  John.D@gmail.com
2  Tiya   Smith  Tiya.R@gmail.com

In [432]:
df_ppl.at[2,'last'] = 'Roza'

In [433]:
df_ppl

  first    last             email
0  Mary  Turner  Mary.T@gmail.com
1  John     Doe  John.D@gmail.com
2  Tiya    Roza  Tiya.R@gmail.com

In [434]:
filt = (df_ppl['email'] == 'Tiya.R@gmail.com')
df_ppl[filt]

  first  last             email
2  Tiya  Roza  Tiya.R@gmail.com

In [435]:
df_ppl[filt]['last'] = 'Smith'

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [436]:
df_ppl

  first    last             email
0  Mary  Turner  Mary.T@gmail.com
1  John     Doe  John.D@gmail.com
2  Tiya    Roza  Tiya.R@gmail.com

In [437]:
df_ppl.loc[filt,'last'] = 'Smith'

In [438]:
df_ppl

  first    last             email
0  Mary  Turner  Mary.T@gmail.com
1  John     Doe  John.D@gmail.com
2  Tiya   Smith  Tiya.R@gmail.com

In [439]:
df_ppl['email'] = df_ppl['email'].str.lower()
df_ppl

  first    last             email
0  Mary  Turner  mary.t@gmail.com
1  John     Doe  john.d@gmail.com
2  Tiya   Smith  tiya.r@gmail.com

# Methods for updating
apply
map
applymap
replace

In [440]:
df_ppl['email'].apply(len)

0    16
1    16
2    16
Name: email, dtype: int64

In [441]:
def update_email(email):
    return email.upper()

In [442]:
df_ppl['email'].apply(update_email)

0    MARY.T@GMAIL.COM
1    JOHN.D@GMAIL.COM
2    TIYA.R@GMAIL.COM
Name: email, dtype: object

In [443]:
df_ppl['email'] = df_ppl['email'].apply(update_email)
df_ppl

  first    last             email
0  Mary  Turner  MARY.T@GMAIL.COM
1  John     Doe  JOHN.D@GMAIL.COM
2  Tiya   Smith  TIYA.R@GMAIL.COM

In [444]:
df_ppl['email'] = df_ppl['email'].apply(lambda x: x.lower())
df_ppl

  first    last             email
0  Mary  Turner  mary.t@gmail.com
1  John     Doe  john.d@gmail.com
2  Tiya   Smith  tiya.r@gmail.com

In [445]:
df_ppl['email'].apply(len)

0    16
1    16
2    16
Name: email, dtype: int64

In [446]:
df_ppl.apply(len)

first    3
last     3
email    3
dtype: int64

In [447]:
len(df_ppl['email'])

3

In [448]:
df_ppl.apply(len, axis='columns')

0    3
1    3
2    3
dtype: int64

In [449]:
df_ppl.apply(pd.Series.min)

first                John
last                  Doe
email    john.d@gmail.com
dtype: object

In [450]:
df_ppl.apply(lambda x : x.min())

first                John
last                  Doe
email    john.d@gmail.com
dtype: object

In [451]:
df_ppl.applymap(len)

   first  last  email
0      4     6     16
1      4     3     16
2      4     5     16

In [452]:
df_ppl.applymap(str.lower)

  first    last             email
0  mary  turner  mary.t@gmail.com
1  john     doe  john.d@gmail.com
2  tiya   smith  tiya.r@gmail.com

In [453]:
df_ppl['first'].map({'Mary':'Kori', 'John':'Johnny'})

0      Kori
1    Johnny
2       NaN
Name: first, dtype: object

In [454]:
df_ppl

  first    last             email
0  Mary  Turner  mary.t@gmail.com
1  John     Doe  john.d@gmail.com
2  Tiya   Smith  tiya.r@gmail.com

In [455]:
df_ppl['first'].replace({'Mary':'Kori', 'John':'Johnny'})

0      Kori
1    Johnny
2      Tiya
Name: first, dtype: object

In [456]:
df_ppl

  first    last             email
0  Mary  Turner  mary.t@gmail.com
1  John     Doe  john.d@gmail.com
2  Tiya   Smith  tiya.r@gmail.com

In [457]:
df_ppl['first']= df_ppl['first'].replace({'Mary':'Kori', 'John':'Johnny'})

In [458]:
df_ppl

    first    last             email
0    Kori  Turner  mary.t@gmail.com
1  Johnny     Doe  john.d@gmail.com
2    Tiya   Smith  tiya.r@gmail.com

In [459]:
df_sample

   Hobby
0      Y
1      N
2      Y
3      N
4      Y
5      N
6      Y
7      N
8      Y
9      N
10     Y
11     N
12     N
13     N

In [460]:
df_sample['Hobby'].map({'Y':True, 'N':False})

0      True
1     False
2      True
3     False
4      True
5     False
6      True
7     False
8      True
9     False
10     True
11    False
12    False
13    False
Name: Hobby, dtype: bool

In [461]:
df_sample['Hobby'] = df_sample['Hobby'].map({'Y':True, 'N':False})

In [462]:
df_sample

    Hobby
0    True
1   False
2    True
3   False
4    True
5   False
6    True
7   False
8    True
9   False
10   True
11  False
12  False
13  False

In [463]:
df_ppl['full_name']  = df_ppl['first'] + ' ' + df_ppl['last']

# Adding columns

In [464]:
df_ppl

    first    last             email    full_name
0    Kori  Turner  mary.t@gmail.com  Kori Turner
1  Johnny     Doe  john.d@gmail.com   Johnny Doe
2    Tiya   Smith  tiya.r@gmail.com   Tiya Smith

# Removing columns

In [465]:
df_ppl.drop(columns=['first', 'last'])

              email    full_name
0  mary.t@gmail.com  Kori Turner
1  john.d@gmail.com   Johnny Doe
2  tiya.r@gmail.com   Tiya Smith

In [466]:
df_ppl.drop(columns=['first', 'last'], inplace=True)

In [467]:
df_ppl

              email    full_name
0  mary.t@gmail.com  Kori Turner
1  john.d@gmail.com   Johnny Doe
2  tiya.r@gmail.com   Tiya Smith

In [468]:
df_ppl['full_name'].str.split(' ')

0    [Kori, Turner]
1     [Johnny, Doe]
2     [Tiya, Smith]
Name: full_name, dtype: object

In [469]:
df_ppl['full_name'].str.split(' ', expand=True)

        0       1
0    Kori  Turner
1  Johnny     Doe
2    Tiya   Smith

In [470]:
df_ppl[['first', 'last']] = df_ppl['full_name'].str.split(' ', expand=True)

In [471]:
df_ppl

              email    full_name   first    last
0  mary.t@gmail.com  Kori Turner    Kori  Turner
1  john.d@gmail.com   Johnny Doe  Johnny     Doe
2  tiya.r@gmail.com   Tiya Smith    Tiya   Smith

# Adding a row

In [472]:
df_ppl.append({'first':'Tony'})

TypeError: ignored

In [473]:
df_ppl.append({'first':'Tony'},ignore_index=True)

              email    full_name   first    last
0  mary.t@gmail.com  Kori Turner    Kori  Turner
1  john.d@gmail.com   Johnny Doe  Johnny     Doe
2  tiya.r@gmail.com   Tiya Smith    Tiya   Smith
3               NaN          NaN    Tony     NaN

In [474]:
people_2 = {'first':['Tony', 'Steve'], 'last':['Stark','Steve'], 'email':['IronMan@avange.com', 'Cap@avenge.com']}

In [475]:
df_ppl2 = pd.DataFrame(people_2)

In [476]:
df_ppl.append(df_ppl2, ignore_index=True)

                email    full_name   first    last
0    mary.t@gmail.com  Kori Turner    Kori  Turner
1    john.d@gmail.com   Johnny Doe  Johnny     Doe
2    tiya.r@gmail.com   Tiya Smith    Tiya   Smith
3  IronMan@avange.com          NaN    Tony   Stark
4      Cap@avenge.com          NaN   Steve   Steve

In [477]:
df_ppl

              email    full_name   first    last
0  mary.t@gmail.com  Kori Turner    Kori  Turner
1  john.d@gmail.com   Johnny Doe  Johnny     Doe
2  tiya.r@gmail.com   Tiya Smith    Tiya   Smith

In [478]:
df_ppl = df_ppl.append(df_ppl2, ignore_index=True)

In [479]:
df_ppl

                email    full_name   first    last
0    mary.t@gmail.com  Kori Turner    Kori  Turner
1    john.d@gmail.com   Johnny Doe  Johnny     Doe
2    tiya.r@gmail.com   Tiya Smith    Tiya   Smith
3  IronMan@avange.com          NaN    Tony   Stark
4      Cap@avenge.com          NaN   Steve   Steve

# Remove rows

In [480]:
df_ppl.drop(index=4)

                email    full_name   first    last
0    mary.t@gmail.com  Kori Turner    Kori  Turner
1    john.d@gmail.com   Johnny Doe  Johnny     Doe
2    tiya.r@gmail.com   Tiya Smith    Tiya   Smith
3  IronMan@avange.com          NaN    Tony   Stark

In [481]:
filt = df_ppl['last'] == 'Doe'
df_ppl.drop(index=df_ppl[filt].index)

                email    full_name  first    last
0    mary.t@gmail.com  Kori Turner   Kori  Turner
2    tiya.r@gmail.com   Tiya Smith   Tiya   Smith
3  IronMan@avange.com          NaN   Tony   Stark
4      Cap@avenge.com          NaN  Steve   Steve

In [482]:
df_ppl

                email    full_name   first    last
0    mary.t@gmail.com  Kori Turner    Kori  Turner
1    john.d@gmail.com   Johnny Doe  Johnny     Doe
2    tiya.r@gmail.com   Tiya Smith    Tiya   Smith
3  IronMan@avange.com          NaN    Tony   Stark
4      Cap@avenge.com          NaN   Steve   Steve

In [483]:
filt = df_ppl['last'] == 'Doe'
df_ppl.drop(index=df_ppl[filt].index, inplace=True)
df_ppl

                email    full_name  first    last
0    mary.t@gmail.com  Kori Turner   Kori  Turner
2    tiya.r@gmail.com   Tiya Smith   Tiya   Smith
3  IronMan@avange.com          NaN   Tony   Stark
4      Cap@avenge.com          NaN  Steve   Steve

# Sorting Data

In [484]:
df_ppl.sort_values(by='last')

                email    full_name  first    last
2    tiya.r@gmail.com   Tiya Smith   Tiya   Smith
3  IronMan@avange.com          NaN   Tony   Stark
4      Cap@avenge.com          NaN  Steve   Steve
0    mary.t@gmail.com  Kori Turner   Kori  Turner

In [485]:
df_ppl.sort_values(by='last', ascending=False)

                email    full_name  first    last
0    mary.t@gmail.com  Kori Turner   Kori  Turner
4      Cap@avenge.com          NaN  Steve   Steve
3  IronMan@avange.com          NaN   Tony   Stark
2    tiya.r@gmail.com   Tiya Smith   Tiya   Smith

In [486]:
df_ppl.sort_values(by= ['last','first'], ascending=False)

                email    full_name  first    last
0    mary.t@gmail.com  Kori Turner   Kori  Turner
4      Cap@avenge.com          NaN  Steve   Steve
3  IronMan@avange.com          NaN   Tony   Stark
2    tiya.r@gmail.com   Tiya Smith   Tiya   Smith

In [487]:
df_ppl = df_ppl.append({'first':'Adam','last':'Stark'}, ignore_index=True)

In [488]:
df_ppl

                email    full_name  first    last
0    mary.t@gmail.com  Kori Turner   Kori  Turner
1    tiya.r@gmail.com   Tiya Smith   Tiya   Smith
2  IronMan@avange.com          NaN   Tony   Stark
3      Cap@avenge.com          NaN  Steve   Steve
4                 NaN          NaN   Adam   Stark

In [489]:
df_ppl.sort_values(by= ['last','first'], ascending=[False, True], inplace=True)

In [490]:
df_ppl

                email    full_name  first    last
0    mary.t@gmail.com  Kori Turner   Kori  Turner
3      Cap@avenge.com          NaN  Steve   Steve
4                 NaN          NaN   Adam   Stark
2  IronMan@avange.com          NaN   Tony   Stark
1    tiya.r@gmail.com   Tiya Smith   Tiya   Smith

In [491]:
df_ppl.sort_index()

                email    full_name  first    last
0    mary.t@gmail.com  Kori Turner   Kori  Turner
1    tiya.r@gmail.com   Tiya Smith   Tiya   Smith
2  IronMan@avange.com          NaN   Tony   Stark
3      Cap@avenge.com          NaN  Steve   Steve
4                 NaN          NaN   Adam   Stark

In [492]:
df_ppl['last'].sort_values()

1     Smith
4     Stark
2     Stark
3     Steve
0    Turner
Name: last, dtype: object

In [494]:
df

             longitude  latitude  ...  median_income  median_house_value
total_rooms                       ...
5612.0         -114.31     34.19  ...         1.4936             66900.0
7650.0         -114.47     34.40  ...         1.8200             80100.0
720.0          -114.56     33.69  ...         1.6509             85700.0
1501.0         -114.57     33.64  ...         3.1917             73400.0
1454.0         -114.57     33.57  ...         1.9250             65500.0
...                ...       ...  ...            ...                 ...
2217.0         -124.26     40.58  ...         2.3571            111400.0
2349.0         -124.27     40.69  ...         2.5179             79000.0
2677.0         -124.30     41.84  ...         3.0313            103600.0
2672.0         -124.30     41.80  ...         1.9797             85800.0
1820.0         -124.35     40.54  ...         3.0147             94600.0

[17000 rows x 8 columns]

In [495]:
df.sort_values(by='housing_median_age').head(50)

             longitude  latitude  ...  median_income  median_house_value
total_rooms                       ...
2062.0         -122.00     38.23  ...         5.2636            191300.0
2254.0         -120.93     37.65  ...         4.2500            189200.0
3867.0         -117.17     34.12  ...         5.4138            164400.0
5989.0         -118.61     34.38  ...         6.6916            329500.0
966.0          -118.56     34.42  ...         1.9667            450000.0
12837.0        -117.33     33.90  ...         5.1512            187800.0
337.0          -117.27     33.93  ...         3.1042            164800.0
838.0          -122.01     37.59  ...         2.8750            237500.0
11965.0        -117.50     34.12  ...         5.2850            191700.0
2701.0         -118.01     34.55  ...         4.0710            137400.0
4055.0         -119.88     36.83  ...         4.2132             96500.0
10008.0        -117.68     33.57  ...        10.1122            500001.0
1205.0         -122.43     37.78  ...         3.6437            275000.0
4198.0         -117.21     33.82  ...         3.9052            122100.0
6900.0         -116.89     33.86  ...         3.0417            146300.0
2103.0         -118.19     34.87  ...         5.0553            111100.0
2629.0         -117.26     33.19  ...         4.2361            158500.0
790.0          -121.85     38.43  ...         5.0862            166500.0
2411.0         -117.65     33.58  ...         7.8061            331400.0
1871.0         -120.88     37.52  ...         2.6103            133600.0
21897.0        -121.35     38.72  ...         4.5432            151300.0
1136.0         -121.89     37.39  ...         4.3750            425000.0
2530.0         -117.71     33.58  ...         4.6336            187500.0
6992.0         -121.35     38.46  ...         4.3879            144400.0
7826.0         -117.62     33.64  ...        10.1531            484100.0
7401.0         -117.17     33.66  ...         4.1386            177300.0
4860.0         -117.59     33.65  ...         4.5022            151900.0
7544.0         -117.58     34.00  ...         4.0037            245200.0
1937.0         -122.32     40.58  ...         3.0000            114200.0
6403.0         -121.29     38.01  ...         4.4871            137900.0
4678.0         -117.61     33.63  ...         6.1078            219000.0
556.0          -117.78     33.97  ...         8.4411            500001.0
11008.0        -118.16     34.60  ...         6.4865            204400.0
647.0          -122.51     37.91  ...         6.6410            310000.0
1424.0         -117.23     33.83  ...         4.0833            100000.0
2239.0         -121.45     37.72  ...         5.7500            240200.0
227.0          -121.93     37.78  ...         3.1591            434700.0
582.0          -117.76     33.81  ...         7.1193            500001.0
5261.0         -117.70     33.51  ...         6.8279            279000.0
6718.0         -122.08     38.30  ...         6.8872            305200.0
20391.0        -117.16     33.57  ...         3.9443            187300.0
2112.0         -117.70     33.56  ...         6.9343            298500.0
3129.0         -121.96     37.99  ...         2.9591            210100.0
4624.0         -117.23     33.16  ...         3.6736            214500.0
17978.0        -117.52     33.89  ...         5.1695            220800.0
6305.0         -117.15     33.70  ...         3.1319            111500.0
2682.0         -121.42     37.73  ...         5.9934            196700.0
96.0           -115.80     33.26  ...         5.3374             47500.0
1658.0         -117.28     34.06  ...         5.1365            136700.0
7747.0         -121.92     38.34  ...         6.1112            181000.0

[50 rows x 8 columns]

In [496]:
df.sort_values(by=['housing_median_age','total_bedrooms'],inplace=True)
df[['housing_median_age','total_bedrooms']].head(50)

             housing_median_age  total_bedrooms
total_rooms
2254.0                      1.0           328.0
2062.0                      1.0           343.0
96.0                        2.0            18.0
227.0                       2.0            35.0
337.0                       2.0            55.0
556.0                       2.0            63.0
582.0                       2.0            70.0
790.0                       2.0           135.0
647.0                       2.0           136.0
1424.0                      2.0           251.0
966.0                       2.0           270.0
1658.0                      2.0           290.0
838.0                       2.0           295.0
2112.0                      2.0           305.0
2239.0                      2.0           321.0
1937.0                      2.0           350.0
2411.0                      2.0           354.0
1136.0                      2.0           365.0
2103.0                      2.0           389.0
2682.0                      2.0           393.0
1871.0                      2.0           409.0
1205.0                      2.0           468.0
2629.0                      2.0           509.0
2701.0                      2.0           530.0
2530.0                      2.0           562.0
3867.0                      2.0           573.0
3129.0                      2.0           707.0
4055.0                      2.0           735.0
5261.0                      2.0           763.0
4198.0                      2.0           805.0
4678.0                      2.0           817.0
6718.0                      2.0           858.0
5989.0                      2.0           883.0
7826.0                      2.0           893.0
4624.0                      2.0           946.0
6403.0                      2.0          1116.0
6992.0                      2.0          1132.0
7747.0                      2.0          1133.0
7401.0                      2.0          1187.0
4860.0                      2.0          1193.0
6900.0                      2.0          1238.0
6305.0                      2.0          1265.0
10008.0                     2.0          1453.0
7544.0                      2.0          1516.0
11008.0                     2.0          1549.0
12360.0                     2.0          1747.0
11965.0                     2.0          1802.0
12837.0                     2.0          1842.0
17978.0                     2.0          3217.0
20391.0                     2.0          3245.0

In [497]:
df.sort_values(by=['housing_median_age','total_bedrooms'],ascending=[True,False], inplace=True)
df[['housing_median_age','total_bedrooms']].head(50)

             housing_median_age  total_bedrooms
total_rooms
2062.0                      1.0           343.0
2254.0                      1.0           328.0
21897.0                     2.0          3513.0
20391.0                     2.0          3245.0
17978.0                     2.0          3217.0
12837.0                     2.0          1842.0
11965.0                     2.0          1802.0
12360.0                     2.0          1747.0
11008.0                     2.0          1549.0
7544.0                      2.0          1516.0
10008.0                     2.0          1453.0
6305.0                      2.0          1265.0
6900.0                      2.0          1238.0
4860.0                      2.0          1193.0
7401.0                      2.0          1187.0
7747.0                      2.0          1133.0
6992.0                      2.0          1132.0
6403.0                      2.0          1116.0
4624.0                      2.0           946.0
7826.0                      2.0           893.0
5989.0                      2.0           883.0
6718.0                      2.0           858.0
4678.0                      2.0           817.0
4198.0                      2.0           805.0
5261.0                      2.0           763.0
4055.0                      2.0           735.0
3129.0                      2.0           707.0
3867.0                      2.0           573.0
2530.0                      2.0           562.0
2701.0                      2.0           530.0
2629.0                      2.0           509.0
1205.0                      2.0           468.0
1871.0                      2.0           409.0
2682.0                      2.0           393.0
2103.0                      2.0           389.0
1136.0                      2.0           365.0
2411.0                      2.0           354.0
1937.0                      2.0           350.0
2239.0                      2.0           321.0
2112.0                      2.0           305.0
838.0                       2.0           295.0
1658.0                      2.0           290.0
966.0                       2.0           270.0
1424.0                      2.0           251.0
647.0                       2.0           136.0
790.0                       2.0           135.0
582.0                       2.0            70.0
556.0                       2.0            63.0
337.0                       2.0            55.0
227.0                       2.0            35.0

In [498]:
df['total_bedrooms'].nlargest(10)

total_rooms
32627.0    6445.0
37937.0    5471.0
32054.0    5290.0
30401.0    4957.0
17286.0    4952.0
25135.0    4819.0
25957.0    4798.0
19234.0    4492.0
17377.0    4457.0
23866.0    4407.0
Name: total_bedrooms, dtype: float64

In [499]:
df.nlargest(10, 'total_bedrooms')

             longitude  latitude  ...  median_income  median_house_value
total_rooms                       ...
32627.0        -121.79     36.64  ...         2.3087            118800.0
37937.0        -117.74     33.89  ...         7.4947            366300.0
32054.0        -117.78     34.03  ...         6.0191            253900.0
30401.0        -117.12     33.52  ...         4.5841            212300.0
17286.0        -117.34     33.98  ...         1.7579            103400.0
25135.0        -117.42     33.35  ...         2.5729            134400.0
25957.0        -118.46     34.40  ...         4.5420            195300.0
19234.0        -121.68     36.72  ...         3.2652            152800.0
17377.0        -118.52     34.17  ...         3.2154            259600.0
23866.0        -118.72     34.14  ...         5.4032            318500.0

[10 rows x 8 columns]

In [500]:
df_public = pd.read_csv('/content/sample_data/survey_results_public.csv')

In [501]:
df_schema = pd.read_csv('/content/sample_data/survey_results_schema.csv')

# Grouping and Aggregating - Analyzing and Exploring Your Data

In [502]:
df_public.head(10)

   Respondent  ...                  SurveyEase
0           1  ...  Neither easy nor difficult
1           2  ...  Neither easy nor difficult
2           3  ...  Neither easy nor difficult
3           4  ...                        Easy
4           5  ...                        Easy
5           6  ...  Neither easy nor difficult
6           7  ...  Neither easy nor difficult
7           8  ...  Neither easy nor difficult
8           9  ...  Neither easy nor difficult
9          10  ...                   Difficult

[10 rows x 85 columns]

In [503]:
df_public['ConvertedComp'].head(15)

0          NaN
1          NaN
2       8820.0
3      61000.0
4          NaN
5     366420.0
6          NaN
7          NaN
8      95179.0
9      13293.0
10         NaN
11         NaN
12     90000.0
13     57060.0
14         NaN
Name: ConvertedComp, dtype: float64

In [504]:
df_public['ConvertedComp'].median()

57287.0

In [505]:
df_public.median()

Respondent       44442.0
CompTotal        62000.0
ConvertedComp    57287.0
WorkWeekHrs         40.0
CodeRevHrs           4.0
Age                 29.0
dtype: float64

In [506]:
df_public.describe()

         Respondent     CompTotal  ...    CodeRevHrs           Age
count  88883.000000  5.594500e+04  ...  49790.000000  79210.000000
mean   44442.000000  5.519014e+11  ...      5.084308     30.336699
std    25658.456325  7.331926e+13  ...      5.513931      9.178390
min        1.000000  0.000000e+00  ...      0.000000      1.000000
25%    22221.500000  2.000000e+04  ...      2.000000     24.000000
50%    44442.000000  6.200000e+04  ...      4.000000     29.000000
75%    66662.500000  1.200000e+05  ...      6.000000     35.000000
max    88883.000000  1.000000e+16  ...     99.000000     99.000000

[8 rows x 6 columns]

In [507]:
df_public['Hobbyist'].value_counts()

Yes    71257
No     17626
Name: Hobbyist, dtype: int64

In [508]:
df_public['SocialMedia'].value_counts()

Reddit                      14374
YouTube                     13830
WhatsApp                    13347
Facebook                    13178
Twitter                     11398
Instagram                    6261
I don't use social media     5554
LinkedIn                     4501
WeChat å¾®ä¿¡                     667
Snapchat                      628
VK Ð’ÐšÐ¾Ð½Ñ‚Ð°ÌÐºÑ‚Ðµ                 603
Weibo æ–°æµªå¾®åš                     56
Youku Tudou ä¼˜é…·                 21
Hello                          19
Name: SocialMedia, dtype: int64

In [509]:
df_schema.set_index('Column')

                                                   QuestionText
Column
Respondent    Randomized respondent ID number (not in order ...
MainBranch    Which of the following options best describes ...
Hobbyist                                Do you code as a hobby?
OpenSourcer         How often do you contribute to open source?
OpenSource    How do you feel about the quality of open sour...
...                                                         ...
Sexuality     Which of the following do you currently identi...
Ethnicity     Which of the following do you identify as? Ple...
Dependents    Do you have any dependents (e.g., children, el...
SurveyLength  How do you feel about the length of the survey...
SurveyEase    How easy or difficult was this survey to compl...

[85 rows x 1 columns]

In [510]:
df_schema = df_schema.set_index('Column')

In [511]:
df_schema

                                                   QuestionText
Column
Respondent    Randomized respondent ID number (not in order ...
MainBranch    Which of the following options best describes ...
Hobbyist                                Do you code as a hobby?
OpenSourcer         How often do you contribute to open source?
OpenSource    How do you feel about the quality of open sour...
...                                                         ...
Sexuality     Which of the following do you currently identi...
Ethnicity     Which of the following do you identify as? Ple...
Dependents    Do you have any dependents (e.g., children, el...
SurveyLength  How do you feel about the length of the survey...
SurveyEase    How easy or difficult was this survey to compl...

[85 rows x 1 columns]

In [512]:
df_schema.loc['SocialMedia']

QuestionText    What social media site do you use the most?
Name: SocialMedia, dtype: object

In [513]:
df_public['SocialMedia'].value_counts(normalize=True)

Reddit                      0.170233
YouTube                     0.163791
WhatsApp                    0.158071
Facebook                    0.156069
Twitter                     0.134988
Instagram                   0.074150
I don't use social media    0.065777
LinkedIn                    0.053306
WeChat å¾®ä¿¡                   0.007899
Snapchat                    0.007437
VK Ð’ÐšÐ¾Ð½Ñ‚Ð°ÌÐºÑ‚Ðµ               0.007141
Weibo æ–°æµªå¾®åš                  0.000663
Youku Tudou ä¼˜é…·              0.000249
Hello                       0.000225
Name: SocialMedia, dtype: float64

# Grouping - Split - Apply Function - Combine Results

In [514]:
df_public['Country'].value_counts()

United States                       20949
India                                9061
Germany                              5866
United Kingdom                       5737
Canada                               3395
                                    ...
Saint Vincent and the Grenadines        1
Brunei Darussalam                       1
Niger                                   1
Dominica                                1
Timor-Leste                             1
Name: Country, Length: 179, dtype: int64

In [515]:
df_public.groupby('Country')

In [516]:
country = df_public.groupby('Country')

In [517]:
country.get_group('India')

       Respondent  ...                  SurveyEase
7               8  ...  Neither easy nor difficult
9              10  ...                   Difficult
14             15  ...  Neither easy nor difficult
49             50  ...                        Easy
64             65  ...  Neither easy nor difficult
...           ...  ...                         ...
88808       77339  ...                         NaN
88825       79795  ...                   Difficult
88852       83862  ...  Neither easy nor difficult
88853       84299  ...                         NaN
88864       86012  ...                        Easy

[9061 rows x 85 columns]

In [518]:
filt = (df_public['Country'] == 'India')
df_public[filt]

       Respondent  ...                  SurveyEase
7               8  ...  Neither easy nor difficult
9              10  ...                   Difficult
14             15  ...  Neither easy nor difficult
49             50  ...                        Easy
64             65  ...  Neither easy nor difficult
...           ...  ...                         ...
88808       77339  ...                         NaN
88825       79795  ...                   Difficult
88852       83862  ...  Neither easy nor difficult
88853       84299  ...                         NaN
88864       86012  ...                        Easy

[9061 rows x 85 columns]

In [519]:
df_public.loc[filt]['SocialMedia'].value_counts()

WhatsApp                    2990
YouTube                     1820
LinkedIn                     955
Facebook                     841
Instagram                    822
Twitter                      542
Reddit                       473
I don't use social media     250
Snapchat                      23
Hello                          5
WeChat å¾®ä¿¡                      5
VK Ð’ÐšÐ¾Ð½Ñ‚Ð°ÌÐºÑ‚Ðµ                  4
Youku Tudou ä¼˜é…·                 2
Weibo æ–°æµªå¾®åš                     1
Name: SocialMedia, dtype: int64

In [520]:
country['SocialMedia'].value_counts()

Country      SocialMedia
Afghanistan  Facebook                    15
             YouTube                      9
             I don't use social media     6
             WhatsApp                     4
             Instagram                    1
                                         ..
Zimbabwe     Facebook                     3
             YouTube                      3
             Instagram                    2
             LinkedIn                     2
             Reddit                       1
Name: SocialMedia, Length: 1220, dtype: int64

In [521]:
country['SocialMedia'].value_counts().head(50)

Country              SocialMedia
Afghanistan          Facebook                     15
                     YouTube                       9
                     I don't use social media      6
                     WhatsApp                      4
                     Instagram                     1
                     LinkedIn                      1
                     Twitter                       1
Albania              WhatsApp                     18
                     Facebook                     16
                     Instagram                    13
                     YouTube                      10
                     Twitter                       8
                     LinkedIn                      7
                     Reddit                        6
                     I don't use social media      4
                     Snapchat                      1
                     WeChat å¾®ä¿¡                     1
Algeria              YouTube                      42
                     Facebook                     41
                     Twitter                      14
                     LinkedIn                      9
                     I don't use social media      7
                     Instagram                     7
                     Reddit                        2
                     WhatsApp                      2
Andorra              Facebook                      2
                     I don't use social media      2
                     Reddit                        1
                     Snapchat                      1
                     YouTube                       1
Angola               Twitter                       2
                     Facebook                      1
                     YouTube                       1
Antigua and Barbuda  YouTube                       2
                     Facebook                      1
                     Instagram                     1
                     Twitter                       1
                     VK Ð’ÐšÐ¾Ð½Ñ‚Ð°ÌÐºÑ‚Ðµ                 1
Argentina            WhatsApp                    202
                     Twitter                      80
                     YouTube                      62
                     Instagram                    53
                     Reddit                       50
                     Facebook                     45
                     I don't use social media     22
                     LinkedIn                     16
Armenia              Facebook                     38
                     YouTube                      23
                     LinkedIn                      5
                     Instagram                     3
Name: SocialMedia, dtype: int64

In [522]:
country['SocialMedia'].value_counts().loc['India']

SocialMedia
WhatsApp                    2990
YouTube                     1820
LinkedIn                     955
Facebook                     841
Instagram                    822
Twitter                      542
Reddit                       473
I don't use social media     250
Snapchat                      23
Hello                          5
WeChat å¾®ä¿¡                      5
VK Ð’ÐšÐ¾Ð½Ñ‚Ð°ÌÐºÑ‚Ðµ                  4
Youku Tudou ä¼˜é…·                 2
Weibo æ–°æµªå¾®åš                     1
Name: SocialMedia, dtype: int64

In [523]:
country['SocialMedia'].value_counts(normalize=True).loc['India']

SocialMedia
WhatsApp                    0.342379
YouTube                     0.208405
LinkedIn                    0.109355
Facebook                    0.096301
Instagram                   0.094126
Twitter                     0.062063
Reddit                      0.054162
I don't use social media    0.028627
Snapchat                    0.002634
Hello                       0.000573
WeChat å¾®ä¿¡                   0.000573
VK Ð’ÐšÐ¾Ð½Ñ‚Ð°ÌÐºÑ‚Ðµ               0.000458
Youku Tudou ä¼˜é…·              0.000229
Weibo æ–°æµªå¾®åš                  0.000115
Name: SocialMedia, dtype: float64

In [524]:
country['ConvertedComp'].median()

Country
Afghanistan                               6222.0
Albania                                  10818.0
Algeria                                   7878.0
Andorra                                 160931.0
Angola                                    7764.0
                                          ...
Venezuela, Bolivarian Republic of...      6384.0
Viet Nam                                 11892.0
Yemen                                    11940.0
Zambia                                    5040.0
Zimbabwe                                 19200.0
Name: ConvertedComp, Length: 179, dtype: float64

In [525]:
country['ConvertedComp'].median().loc['Germany']

63016.0

In [526]:
country['ConvertedComp'].agg(['median','mean'])

                                        median           mean
Country
Afghanistan                             6222.0  101953.333333
Albania                                10818.0   21833.700000
Algeria                                 7878.0   34924.047619
Andorra                               160931.0  160931.000000
Angola                                  7764.0    7764.000000
...                                        ...            ...
Venezuela, Bolivarian Republic of...    6384.0   14581.627907
Viet Nam                               11892.0   17233.436782
Yemen                                  11940.0   16909.166667
Zambia                                  5040.0   10075.375000
Zimbabwe                               19200.0   34046.666667

[179 rows x 2 columns]

In [527]:
df_public[filt]['LanguageWorkedWith'].str.contains('Python')

7         True
9         True
14       False
49        True
64       False
         ...
88808    False
88825     True
88852    False
88853     True
88864    False
Name: LanguageWorkedWith, Length: 9061, dtype: object

In [528]:
df_public[filt]['LanguageWorkedWith'].str.contains('Python').sum()

3105

In [529]:
country['LanguageWorkedWith'].str.contains('Python').sum()

AttributeError: ignored

In [530]:
country['LanguageWorkedWith'].apply(lambda x : x.str.contains('Python').sum())

Country
Afghanistan                              8
Albania                                 23
Algeria                                 40
Andorra                                  0
Angola                                   2
                                        ..
Venezuela, Bolivarian Republic of...    28
Viet Nam                                78
Yemen                                    3
Zambia                                   4
Zimbabwe                                14
Name: LanguageWorkedWith, Length: 179, dtype: int64

In [531]:
country['LanguageWorkedWith'].apply(lambda x : x.str.contains('Python').sum()).loc['India']

3105

In [532]:
country_rep = df_public['Country'].value_counts()
country_rep

United States                       20949
India                                9061
Germany                              5866
United Kingdom                       5737
Canada                               3395
                                    ...
Saint Vincent and the Grenadines        1
Brunei Darussalam                       1
Niger                                   1
Dominica                                1
Timor-Leste                             1
Name: Country, Length: 179, dtype: int64

In [533]:
country_uses_python = country['LanguageWorkedWith'].apply(lambda x : x.str.contains('Python').sum())
country_uses_python

Country
Afghanistan                              8
Albania                                 23
Algeria                                 40
Andorra                                  0
Angola                                   2
                                        ..
Venezuela, Bolivarian Republic of...    28
Viet Nam                                78
Yemen                                    3
Zambia                                   4
Zimbabwe                                14
Name: LanguageWorkedWith, Length: 179, dtype: int64

In [534]:
python_df = pd.concat([country_rep, country_uses_python], axis = 'columns')
python_df

                                  Country  LanguageWorkedWith
United States                       20949               10083
India                                9061                3105
Germany                              5866                2451
United Kingdom                       5737                2384
Canada                               3395                1558
...                                   ...                 ...
Saint Vincent and the Grenadines        1                   0
Brunei Darussalam                       1                   0
Niger                                   1                   1
Dominica                                1                   1
Timor-Leste                             1                   1

[179 rows x 2 columns]

In [535]:
python_df.rename(columns={'Country':'NumRespondents', 'LanguageWorkedWith':'NumKnowsPython'}, inplace=True)

In [536]:
python_df['PctKnowsPython'] = (python_df['NumKnowsPython']/python_df['NumRespondents'])*100

In [537]:
python_df

                                  NumRespondents  ...  PctKnowsPython
United States                              20949  ...       48.131176
India                                       9061  ...       34.267741
Germany                                     5866  ...       41.783157
United Kingdom                              5737  ...       41.554820
Canada                                      3395  ...       45.891016
...                                          ...  ...             ...
Saint Vincent and the Grenadines               1  ...        0.000000
Brunei Darussalam                              1  ...        0.000000
Niger                                          1  ...      100.000000
Dominica                                       1  ...      100.000000
Timor-Leste                                    1  ...      100.000000

[179 rows x 3 columns]

In [538]:
python_df.sort_values(by = 'PctKnowsPython', ascending=False, inplace=True)
python_df

                                  NumRespondents  ...  PctKnowsPython
Timor-Leste                                    1  ...      100.000000
Dominica                                       1  ...      100.000000
Niger                                          1  ...      100.000000
Sao Tome and Principe                          1  ...      100.000000
Turkmenistan                                   7  ...       85.714286
...                                          ...  ...             ...
Liberia                                        2  ...        0.000000
Burkina Faso                                   4  ...        0.000000
Malawi                                         2  ...        0.000000
Lao People's Democratic Republic               3  ...        0.000000
Djibouti                                       2  ...        0.000000

[179 rows x 3 columns]

In [539]:
python_df.head(50)

                                  NumRespondents  ...  PctKnowsPython
Timor-Leste                                    1  ...      100.000000
Dominica                                       1  ...      100.000000
Niger                                          1  ...      100.000000
Sao Tome and Principe                          1  ...      100.000000
Turkmenistan                                   7  ...       85.714286
Mauritania                                     7  ...       71.428571
Bahamas                                        3  ...       66.666667
Guinea                                         3  ...       66.666667
Guyana                                         3  ...       66.666667
Uganda                                        72  ...       65.277778
Iceland                                       49  ...       61.224490
Benin                                          5  ...       60.000000
Namibia                                        5  ...       60.000000
Haiti                                          5  ...       60.000000
Congo, Republic of the...                      7  ...       57.142857
Oman                                          11  ...       54.545455
Cuba                                          30  ...       53.333333
Republic of Korea                             39  ...       51.282051
Monaco                                         4  ...       50.000000
San Marino                                     2  ...       50.000000
Bhutan                                         2  ...       50.000000
Seychelles                                     2  ...       50.000000
Sierra Leone                                   2  ...       50.000000
South Korea                                  160  ...       50.000000
Chile                                        206  ...       49.514563
Finland                                      546  ...       48.717949
Kenya                                        249  ...       48.192771
United States                              20949  ...       48.131176
Israel                                       952  ...       48.004202
Ecuador                                       82  ...       47.560976
Mongolia                                      17  ...       47.058824
Montenegro                                    17  ...       47.058824
Taiwan                                       187  ...       47.058824
Switzerland                                  978  ...       47.034765
United Republic of Tanzania                   32  ...       46.875000
Hong Kong (S.A.R.)                           188  ...       46.808511
Japan                                        391  ...       46.547315
Maldives                                      13  ...       46.153846
Canada                                      3395  ...       45.891016
Singapore                                    303  ...       45.874587
New Zealand                                  524  ...       45.038168
China                                        664  ...       44.728916
Honduras                                      27  ...       44.444444
France                                      2391  ...       44.081974
Iraq                                          39  ...       43.589744
Thailand                                     214  ...       42.990654
Democratic Republic of the Congo               7  ...       42.857143
Nepal                                        237  ...       42.616034
Estonia                                      195  ...       42.051282
Russian Federation                          1694  ...       41.794569

[50 rows x 3 columns]

In [540]:
python_df.loc['India']

NumRespondents    9061.000000
NumKnowsPython    3105.000000
PctKnowsPython      34.267741
Name: India, dtype: float64